In [1]:
import numpy as np
import pandas as pd

In [4]:
data =  {
    'Company' : ['goog' , 'goog' , 'msft', 'msft', 'tesla' , 'tesla'],
    'Person' : ['archie', 'betty', 'jughead', 'veronica' ,'cheryl', 'toni'],
    'Sales' : [200, 120, 340, 124, 243, 350]
}
data

{'Company': ['goog', 'goog', 'msft', 'msft', 'tesla', 'tesla'],
 'Person': ['archie', 'betty', 'jughead', 'veronica', 'cheryl', 'toni'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [5]:
df = pd.DataFrame(data)
df

  Company    Person  Sales
0    goog    archie    200
1    goog     betty    120
2    msft   jughead    340
3    msft  veronica    124
4   tesla    cheryl    243
5   tesla      toni    350

In [6]:
# grooup by then some sort of aggregate function
byCompany = df.groupby('Company')
byCompany

In [7]:
byCompany.mean()

         Sales
Company
goog     160.0
msft     232.0
tesla    296.5

In [9]:
byCompany.sum()

         Sales
Company
goog       320
msft       464
tesla      593

In [10]:
byCompany.std()

              Sales
Company
goog      56.568542
msft     152.735065
tesla     75.660426

In [11]:
byCompany.std().loc['msft']

Sales    152.735065
Name: msft, dtype: float64

In [12]:
df.groupby('Company').sum().loc['tesla']

Sales    593
Name: tesla, dtype: int64

In [13]:
df.groupby('Company').count()

         Person  Sales
Company
goog          2      2
msft          2      2
tesla         2      2

In [14]:
df.groupby('Company').max()

           Person  Sales
Company
goog        betty    200
msft     veronica    340
tesla        toni    350

In [15]:
df.groupby('Company').min()

          Person  Sales
Company
goog      archie    120
msft     jughead    124
tesla     cheryl    243

In [16]:
df

  Company    Person  Sales
0    goog    archie    200
1    goog     betty    120
2    msft   jughead    340
3    msft  veronica    124
4   tesla    cheryl    243
5   tesla      toni    350

In [17]:
df.groupby('Company').max()

           Person  Sales
Company
goog        betty    200
msft     veronica    340
tesla        toni    350

In [20]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
msft      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
tesla     2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0

In [24]:
df.groupby('Company').describe().transpose()

Company            goog        msft       tesla
Sales count    2.000000    2.000000    2.000000
      mean   160.000000  232.000000  296.500000
      std     56.568542  152.735065   75.660426
      min    120.000000  124.000000  243.000000
      25%    140.000000  178.000000  269.750000
      50%    160.000000  232.000000  296.500000
      75%    180.000000  286.000000  323.250000
      max    200.000000  340.000000  350.000000